In [15]:
%run utils.ipynb

In [16]:
transaction_json_df, transaction_json_df_counts = read_transactions_txt(raw_path)

In [17]:
transaction_json_df.head(10)

  location_id        date transaction_id   profit
0         009  01-02-2019            001  0024.67
1         009  01-02-2019            002  0022.99
2         009  01-02-2019            003  0022.81
3         009  01-02-2019            004  0021.76
4         009  01-02-2019            005  0026.45
5         009  01-02-2019            006  0000026
6         009  01-02-2019            007  0019.66
7         009  01-02-2019            008  0021.83
8         009  01-02-2019            009  0023.28
9         009  01-02-2019            010  0026.21

In [18]:
assert len(transaction_json_df) == sum(counts)

In [19]:
transaction_json_df.dtypes

location_id       object
date              object
transaction_id    object
profit            object
dtype: object

In [20]:
transaction_json_df['profit'] = transaction_json_df['profit'].apply(clean_profit)
invalid_profit(transaction_json_df)

      location_id        date transaction_id  profit
12204         006  02-05-2020            001     NaN
12334         006  05-28-2020            001     NaN
13807         006  02-10-2021            001     NaN
20069         003  02-10-2020            001     NaN
27659         004  02-07-2020            001     NaN
27688         004  02-14-2020            001     NaN
27780         004  05-28-2020            001     NaN
27782         004  05-30-2020            001     NaN
28962         004  02-05-2021            001     NaN
29018         004  02-17-2021            001     NaN
35882         007  02-17-2020            001     NaN
36106         007  05-28-2020            001     NaN
36107         007  05-29-2020            001     NaN
37877         007  02-15-2021            001     NaN
37879         007  02-17-2021            001     NaN
37880         007  02-18-2021            001     NaN

In [21]:
invalid_location_check(transaction_json_df)

Empty DataFrame
Columns: [location_id, date, transaction_id, profit]
Index: []

In [22]:
date_pattern = r'^\d{2}-\d{2}-\d{4}$'
invalid_date_check(transaction_json_df,date_pattern)

Empty DataFrame
Columns: [location_id, date, transaction_id, profit]
Index: []

In [23]:
invalid_transaction_id_check(transaction_json_df)

Empty DataFrame
Columns: [location_id, date, transaction_id, profit]
Index: []

In [24]:
df.astype(transaction_schema)
df['date'] = pd.to_datetime(transaction_json_df['date'])
df.head(10)

  location_id       date transaction_id  profit
0         009 2019-01-02            001   24.67
1         009 2019-01-02            002   22.99
2         009 2019-01-02            003   22.81
3         009 2019-01-02            004   21.76
4         009 2019-01-02            005   26.45
5         009 2019-01-02            006   26.00
6         009 2019-01-02            007   19.66
7         009 2019-01-02            008   21.83
8         009 2019-01-02            009   23.28
9         009 2019-01-02            010   26.21

In [25]:
df.dtypes

location_id               object
date              datetime64[ns]
transaction_id            object
profit                   float64
dtype: object

In [26]:
nan_counts = transaction_json_df.isna().sum()
print("NaN counts in each column:")
print(nan_counts)

NaN counts in each column:
location_id        0
date               0
transaction_id     0
profit            16
dtype: int64

In [27]:
len(transaction_json_df)

42167

In [28]:
file_name = 'transaction_data_system_2.csv'
write_to_path_bronze(transaction_json_df,bronze_path,file_name)

DataFrame saved to ../Submission/bronze_data/transaction_data/transaction_data_system_2.csv